// ========= Лабораторная работа №1 =========
// Условие:
// Создадим абстрактный класс ICalcer. В нем будет метод calcInt для численного
// расчета интегралов. Создадим два наследника от этого класса с их собственной
// реализацией метода calcInt через метод трапеций и метод Симпсона соответственно.
// В классах должны быть настраиваемые параметры, такие как количество точек,
// шаг и точность методов. Напишем программу, которая сравнивает аналитически
// вычисленный интеграл с значениями, вычисленными созданными классами.

#include <iostream>
#include "icalcer.h"
#include "tests.h"

int main()
{
	double (*func_ptr)(double) = &calc::Func;
	
	// Тест функции вычисления интеграла методом трапеции
	std::cout << "//// TRAPEZE CALCER test\n";
	calc::TrapezeCalcer calculator1;
	Test(calculator1, -0.58, 10.908);

	// Тест функции вычисления интеграла методом Симпсона
	std::cout << "//// SIMPSON CALCER test\n";
	calc::SimpsonCalcer calculator2;
	Test(calculator2, -0.58, 10.908);
}