// ========= Лабораторная работа №2 =========
// Условие:
// Создаем класс натуральной дроби.Он должен реализовывать методы сложения,
// вычитания, умножения, деления, сравнения на равенство и больше - меньше.
// Также должен иметь метод для преобразования в десятичное представление,
// генерацию натуральной дроби из десятичного представления, упрощение
// натуральной дроби и преобразование в смешанную дробь с целой частью.

#include <iostream>
#include "fraction.h"

int main()
{
	frac::Fraction number1 (1, 2);
	frac::Fraction number2 (1000, 1000);
	double num = 0.5;

	std::cout << (1.0 == frac::Fraction::GetBiggest(number1, number2));
}