// ========= Лабораторная работа №2 =========
// Условие:
// Создаем класс натуральной дроби.Он должен реализовывать методы сложения,
// вычитания, умножения, деления, сравнения на равенство и больше - меньше.
// Также должен иметь метод для преобразования в десятичное представление,
// генерацию натуральной дроби из десятичного представления, упрощение
// натуральной дроби и преобразование в смешанную дробь с целой частью.

#include <iostream>
#include "fraction.h"

int main()
{
	frac::Fraction number1 (333, 5);

	frac::MixedFraction fr = number1.FracToMixedFrac();

	std::cout << fr.integer << " ";
	fr.fract.Print();
}